CSI API ETABS v1
cAreaObj.GetPier Method
 Retrieves the pier label assignments of an area object
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetPier(
	string Name,
	ref string PierName
)
Function GetPier (
	Name As String,
	ByRef PierName As String
) As Integer
Dim instance As cAreaObj
Dim Name As String
Dim PierName As String
Dim returnValue As Integer
returnValue = instance.GetPier(Name, PierName)
int GetPier(
	String^ Name,
	String^% PierName
)
abstract GetPier :
        Name : string *
        PierName : string byref -> int
Parameters
Name
Type: System.String
 The name of an existing area object
PierName
Type: System.String
 The name of the pier assignment, if any, or "None"
Return Value
Type: Int32
 Returns zero if the assignment is successfully retrieved; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
   Dim PierName as String
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'define new pier label
    ret = SapModel.PierLabel.SetPier("MyPier")
'set assignment
    ret = SapModel.AreaObj.SetPier("3", "MyPier")
'get assignment
    ret = SapModel.AreaObj.GetPier("3", PierName)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cAreaObj Interface
ETABSv1 Namespace